Revit 2027 API
SunAndShadowSettings.IsBeforeEndDateAndTime Method
 Checks whether the start date and time is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBeforeEndDateAndTime(
	DateTime time
)
Public Function IsBeforeEndDateAndTime (
	time As DateTime
) As Boolean
public:
bool IsBeforeEndDateAndTime(
	DateTime time
)
member IsBeforeEndDateAndTime :
        time : DateTime -> bool
Parameters
time DateTime
 Date and time value
Return Value
Boolean
 True if the date and time is valid, false otherwise.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace